---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.ForwardIterator
source: html/ea96bcd2-4e22-99da-0eeb-5b4930953cc5.htm
---
# Autodesk.Revit.DB.MullionTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual MullionTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.